import type { IMessageData } from '@utils/types';

export const messages: IMessageData = {
	SOLAR_ENERGY_FOR: 'Сонячна енергія для ',
	PROGRESSIVE_FUTURE: 'прогресивного майбутнього',
	TOTAL_CAPACITY: 'Загальна потужність',
	PIONEERS_IN_THE_FIELD_OF:
		'пионери у сфері відновлюваної енергетики на українському ринку з 2020 року.',
	OUR_SOLAR_POWER_PLANTS:
		'Наші сонячні електростанції, що розташовані в прекрасних околицях Київської області, не лише надійно забезпечують електроенергією, а й дбають про збереження навколишнього середовища. Ми впевнені, що маємо справжню силу змінювати світ, надаючи енергію без викидів CO2.',
	OUR_POWER_PLANTS_USE:
		'Наші електростанції використовують передові технології та мають кваліфікований персонал. Ми постійно удосконалюємо виробничі процеси, щоб забезпечити високу якість електроенергії та оптимальну ефективність установок.',
	LAUNCHED_IN_2020:
		'Запущені у 2020 році, СЕС Вабля-1 і СЕС Вабля-2 мають встановлену потужність 5.73 МВт. Основними показниками електростанцій є КВВП та Инсоляція. ',
	INSTALLED_CAPACITY_UTILIZATION_RATE:
		'Коефіцієнт використання встановленої потужності = середньоарифметична фактична потужность / встановлена потужность електроустаткування (за 12 місяців)',
	AVERAGE_ANNUAL_AMOUNT_OF_GLOBAL_EXPOSURE:
		'Середньорічна сума глобального опромінення на квадратний метр, отримана модулями даної системи основі супутникових даних (кВт*год/м2)',
	KVVP: 'КВВП',
	INSOLATION: 'Инсоляція',
	ENERGY_SOURCES: 'Джерела енергії',
	INFORMATION_ABOUT_THE_COMPANY: 'Інформація про компанію',
	INFORMATION_ABOUT_ENERGY_SOURCES: 'Інформація про джерела енергії',
	ANNUAL_REPORTING: 'Річна звітність',
	ALWAYS_IN_TOUCH_WITH_GREEN_ENERGY: "Завжди на зв'язку з зеленою енергією",
	CONTACTS: 'Контакти',
	DOCUMENTATION: 'Документація',
	ALL_RIGHTS_RESERVED: 'Всі права захищені',
	WEBSITE_CREATED_BY: 'Website created by',
};
